Repository: OSGeo-jp/OSGeoLive-doc-omegat
Catalog: tm/overview--deegree_overview.tmx
Source language: en
Languages: ja

source: deegree provides geospatial webservices based upon |OGC| and `INSPIRE Network Services <https://inspire.ec.europa.eu>`_ specifications. deegree supports:
ja: deegreeは、OGCと「INSPIRE Network Services<https://inspire.ec.europa.eu>」仕様に基づいた地理空間ウェブサービスを提供している。deegreeは以下をサポートしている。

source: |WFS|: Serves vector data from geospatial data
ja: |WFS|: 空間データからベクトルデータを提供

source: |WMS|: Serves maps rendered from geospatial data
ja: |WMS|: 空間データからレンダリングされたマップを提供します。

source: |WMTS|: Serves pre-rendered map tiles
ja: |WMTS|: 事前にレンダリングされたマップタイルを提供

source: |CSW|: Performs searches for geospatial datasets and services
ja: |CSW|: 地理空間データセットおよびサービスの検索を実行します。

source: |WPS|: Executes geospatial processes
ja: |WPS|: 空間処理を実行します

source: Core Features
ja: 主要機能

source: Implements WFS standards 1.0.0, 1.1.0 and 2.0.0
ja: WFS標準1.0.0、1.1.0、および2.0.0を実装

source: Fully transactional (even for rich data models)
ja: 完全なトランザクション(リッチ・データ・モデルの場合も含む)

source: Supports KVP, XML and SOAP requests
ja: KVP、XML、およびSOAP要求をサポート

source: GML 2/3.0/3.1/3.2 output/input
ja: GM L2/3.0/3.1/3.2出力/入力

source: Support for GetGmlObject requests and XLinks
ja: GetGmlObjectリクエストとXLinksのサポート

source: High performance and excellent scalability
ja: 高いパフォーマンスと優れた拡張性

source: On-the-fly coordinate transformation
ja: オンザフライ座標変換

source: Designed for rich data models from the bottom up
ja: ボトムアップのリッチ・データ・モデル向けに設計

source: Backends support flexible mapping of GML application schemas to relational models
ja: バックエンドは、GMLアプリケーションスキーマのリレーショナルモデルへの柔軟なマッピングをサポートします。

source: ISO 19107-compliant geometry model: Complex geometries (e.g. non-linear curves)
ja: ISO19107準拠形状モデル:複雑な形状(例:非線形曲線)

source: Advanced filter expression support based on XPath 1.0
ja: XPath1.0に基づく高度なフィルタ式のサポート

source: Supports numerous backends, such as PostGIS, Oracle Spatial, MS SQL Server, Shapefiles or GML instance documents
ja: PostGIS、Oracle Spatial、MS SQL Server、Shapefiles、GMLインスタンスドキュメントなどの多数のバックエンドをサポート

source: Implements WMS standards 1.1.1 and 1.3.0
ja: WMS標準1.1.1および1.3.0を実装

source: Extensive support for styling languages SLD/SE versions 1.0.0 and 1.1.0
ja: スタイル言語SLD/SEバージョン1.0.0および1.1.0の広範なサポート

source: High quality rendering
ja: 高精度レンダリング

source: Scale dependent styling
ja: スケールに依存するスタイル設定

source: Support for SE removes the need for a lot of proprietary extensions
ja: SEのサポートにより、多くの独自仕様の拡張が不要

source: Easy configuration of HTML and other output formats for GetFeatureInfo responses
ja: GetFeatureInfo応答のHTMLおよびその他の出力フォーマットの簡単な設定

source: Uses stream-based data access with minimal memory footprint
ja: 最小限のメモリ・フットプリントでストリーム・ベースのデータ・アクセスを使用

source: Nearly complete support for raster symbolizing as defined in SE (with some extensions)
ja: SEで定義されているラスターシンボルのほぼ完全なサポート(拡張機能あり)

source: Complete support for TIME/ELEVATION and other dimensions for both feature and raster data
ja: フィーチャデータとラスターデータの両方で、TIME/ELEVATIONおよびその他の寸法が完全にサポートされます。

source: Supports numerous backends, such as PostGIS, Oracle Spatial, Shapefiles or GML instance documents
ja: PostGIS、Oracle Spatial、Shapefiles、GMLインスタンスドキュメントなどの多数のバックエンドをサポート

source: Can render rich data models directly
ja: リッチ・データ・モデルを直接レンダリングできる

source: Implements Basic WMTS standard 1.0.0 (KVP)
ja: 基本的なWMTS標準1.0.0(KVP)を実装

source: Supports different backends, such as GeoTIFF, remote WMS or file system tile image hierarchies
ja: GeoTIFF、リモートWMS、ファイルシステムなどの異なるバックエンドをサポートタイルイメージの階層

source: Supports on-the-fly caching (using EHCache)
ja: オンザフライキャッシュをサポート(EHCキャッシュを使用)

source: Supports GetFeatureInfo for remote WMS backends
ja: リモートWMSバックエンドのGetFeatureInfoをサポート

source: Implements CSW standard 2.0.2
ja: CSW標準2.0.2を実装

source: Fully transactional
ja: 完全なトランザクション

source: ISO Metadata Application Profile 1.0.0
ja: ISOメタデータアプリケーションプロファイル1.0.0

source: Pluggable and modular dataaccess layer allows to add support for new APs and backends
ja: プラグ可能でモジュラー型のデータアクセスレイヤにより、新しいAPとバックエンドのサポートを追加可能

source: Modular inspector architecture allows to validate records to be inserted against various criteria
ja: モジュラー型の検査アーキテクチャにより、さまざまな基準に照らして挿入されたレコードを検証可能

source: Standard inspectors: schema validity, identifier integrity, INSPIRE requirements
ja: 標準インスペクタ: スキーマの妥当性、識別子の完全性、INSPIRE要件

source: Handles all defined queryable properties (for Dublin Core as well as ISO profile)
ja: 定義の定義済みクエリー可能プロパティを処理します(Dublin CoreおよびISOプロファイルの場合)。

source: Complex filter expressions
ja: 複雑なフィルタ式

source: Implements WPS standard 1.0.0
ja: WPS標準1.0.0を実装

source: Pluggable process provider layer
ja: プラガブル・プロセス・プロバイダ層

source: Easy-to-use API for implementing Java processes
ja: Javaプロセスを実装するための使いやすいAPI

source: Supports all variants of input/output parameters: literal, bbox, complex (binary and xml)
ja: 入力/出力パラメータのすべてのバリエーション(literal、bbox、complex(binaryおよびxml))をサポート

source: Streaming access for complex input/output parameters
ja: 複雑な入出力パラメータへのストリーミングアクセス

source: Processing of huge amounts of data with minimal memory footprint
ja: 最小限のメモリ使用量で大量のデータを処理

source: Implemented Standards
ja: 実装されている標準規格

source: Details
ja: 詳細

source: **Website:** http://www.deegree.org
ja: **Webサイト:** http://www.deegree.org

source: **Licence:** LGPL
ja: **ライセンス:** LGPL

source: **Software Version:** |version-deegree|
ja: **ソフトウェアバージョン:** |version-deegree|

source: **Supported Platforms:** Windows, Linux
ja: **対応プラットフォーム:** Windows, Linux

source: **API Interfaces:** Java
ja: **API インターフェイス:** Java

source: **Support:** https://www.deegree.org/community
ja: **サポート:** https://www.deegree.org/community

source: Quickstart
ja: クイックスタート

source: :doc:`Quickstart documentation <../quickstart/deegree_quickstart>`
ja: :doc:`クイックスタート文書 <../quickstart/deegree_quickstart>`
